
w=[1 1 1];

%Наивный способ обхода гиперплоскости критериев

% возможности баллов из множества значений баллов {1,2,..,10}
% строки i по номеру критерия 1..3
p1 = [ 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1 0.1 0.1; 
        0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1 0.1;
         0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1];
     
p2 = [ 0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1; 
        0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1;
         0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1];
     
     
% интеграл dy 
supP = -1;
for y=0:1:20  %10 баллов * {0..2} вес
     
% sum min 1
% требуется обход гиперплоскости с числом измерений = число критериев

    sup1 = -1;
    sup2 = -1;
    x0=[1 1 1]; % начальная точка гиперплоскости
    x=x0;

   % for i=1:3   % критерии 
    for yy=1:1:10
      for zz=1:1:10
        for xx=1:1:10 % баллы по множеству значений 
            x(1) = xx;
            x(2) = yy;
            x(3) = zz;
            Swx = w(1)*x(1)+w(2)*x(2)+w(3)*x(3);
            
            % первый supmin
            if(Swx < y)  % учесть в поиске supmin
               p_line1 = [p1(1,x(1)), p1(2,x(2)), p1(3,x(3)) ];
               new_sup1 = min( p_line1 );
               if( new_sup1 > sup1 )
                   sup1 = new_sup1;
               end
            end
            
            % второй supmin
            if(Swx > y)  % учесть в поиске supmin
               p_line2 = [ p2(1,x(1)), p2(2,x(2)), p2(3,x(3)) ];
               new_sup2 = min( p_line2 );
               if( new_sup2 > sup2 )
                   sup2 = new_sup2;
               end
            end
            
        end
      end
    end %x,y,z
   
  %  end %i
    
    new_supP = min(sup1, sup2);
    if( new_supP > supP )
        supP = new_supP;
    end

end 
P_2more1 = supP


w=[1 1 1];

%possibilities 
% возможности баллов из множества значений баллов {1,2,..,10}
% строки i по номеру критерия 1..3
p1 = [ 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1 0.1 0.1; 
        0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1 0.1;
         0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1];
     
p2 = [ 0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1; 
        0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1;
         0.1 0.1 0.1 0.1 0.1 0.5 1 0.5 0.1 0.1];
     
     
% интеграл dy 
supP = -1;
for y=0:1:20  %10 баллов * {0..2} вес
     
% sum min 1
% требуется обход гиперплоскости с числом измерений = число критериев

    sup1 = -1;
    sup2 = -1;
    x0=[1 1 1]; % начальная точка гиперплоскости
    x=x0;

   % for i=1:3   % критерии 
    for yy=1:1:10
      for zz=1:1:10
        for xx=1:1:10 % баллы по множеству значений 
            x(1) = xx;
            x(2) = yy;
            x(3) = zz;
            Swx = w(1)*x(1)+w(2)*x(2)+w(3)*x(3);
            
            % первый supmin
            if(Swx > y)  % учесть в поиске supmin
               p_line1 = [p1(1,x(1)), p1(2,x(2)), p1(3,x(3)) ];
               new_sup1 = min( p_line1 );
               if( new_sup1 > sup1 )
                   sup1 = new_sup1;
               end
            end
            
            % второй supmin
            if(Swx < y)  % учесть в поиске supmin
               p_line2 = [ p2(1,x(1)), p2(2,x(2)), p2(3,x(3)) ];
               new_sup2 = min( p_line2 );
               if( new_sup2 > sup2 )
                   sup2 = new_sup2;
               end
            end
            
        end
      end
    end %x,y,z
   
  %  end %i
    
    new_supP = min(sup1, sup2);
    if( new_supP > supP )
        supP = new_supP;
    end

end 
P_1more2 = supP


